"""
Описание типов параметров запросов и ответов Wildberries API продавца (1.2)
Wildberries API предоставляет продавцам возможность управления магазином
и получения оперативной и статистической информации по протоколу HTTP RestAPI.
https://openapi.wb.ru/
"""

import warnings

#  TODO: как будет время, указать явно, какие объекты нужны!!!
#
#  TODO: по возможности разделить объекты на подкаталоги
# ----------------------------------------------------
# Types
# ----------------------------------------------------
from .types import *  # noqa

# ----------------------------------------------------
# Request params
# ----------------------------------------------------
from .requests import *  # noqa

# ----------------------------------------------------
# Responses
# ----------------------------------------------------
from .responses import *  # noqa

# ----------------------------------------------------
# Query params
# ----------------------------------------------------
from .query_params import *  # noqa

# ----------------------------------------------------
# Errors
# ----------------------------------------------------
try:
    from .errors import *  # noqa
except (Exception,):
    warnings.warn("Модуль не найден")
